---
kind: method
id: M:Autodesk.Revit.DB.ContentNode.GetTransform
source: html/bab7a7ed-cedc-c4b0-86ad-39c122da12df.htm
---
# Autodesk.Revit.DB.ContentNode.GetTransform Method

A transformation matrix associated with the node.

## Syntax (C#)
```csharp
public Transform GetTransform()
```